import { AdditionalOption } from "@/types/types";

const addOptions: AdditionalOption[] = [ 
  {
    id: "1",
    name: "Відео-представлення компанії    ",
    price: "100$",
    description: "Можливість презентувати свою компанію учасникам перед нетворкінгом у вигляді відео, яке триватиме до 5 хвилин.",
    available: 0
  },
  {
    id: "2",
    name: "Логотип на футболці",
    price: "200$",
    description: "Логотип компанії буде використовуватись на фірмовій футболці івенту, яку отримають переможці, а також організатори.",
    available: 2
  },
  {
    id: "3",
    name: "Тестові співбесіди",
    price: "100$",
    description: "Під час нетворкінгу учасники змагань спробують себе у короткій співбесіді разом з представниками Вашої компанії. Це можливість виявити нові таланти та перспективних працівників серед студентської спільноти.",
    available: 0
  },
  {
    id: "4",
    name: "Розсилка вакансій у Telegram-боті",
    price: "100$",
    description: "Піврічна розсилка вакансій компанії у нашому Telegram-боті, що призначений для реєстрації, важливих анонсів та комунікації під час події.",
    available: 0
  },
  {
    id: "5",
    name: "Доступ до бази CV учасників",
    price: "150$",
    description: "Можливість отримати доступ до бази CV учасників змагань.",
    available: 0
  },
  {
    id: "6",
    name: "Завдання на категорію TD",
    price: "250$",
    description: "Можливість надати завдання на категорію TD. Стосується більш технічної реалізації якогось винаходу.",
    available: 1
  },
  {
    id: "7",
    name: "Завдання на категорію ID",
    price: "250$",
    description: "Можливість надати завдання на категорію ID. Стосується реалізації завдання у вигляді 3D моделі.",
    available: 1
  },
  {
    id: "8",
    name: "День з компанією",
    price: "70$",
    description: "Після проведення події Instagram–stories нашої сторінки будуть наповнені контентом Вашої компанії. Ви можете надіслати свої відео або ж наша команда допоможе у їх створенні. Таких сторіз буде до 3.",
    available: 0
  },
  {
    id: "9",
    name: "Проведення інтерактивних розіграшів",
    price: "70$",
    description: "Можливість провести розіграш від компанії — це може бути Kahoot, Quiz або можете приєднатись до благодійного розіграшу нашої компанії, про Вашу участь скажуть на сцені.",
    available: 0
  },
  {
    id: "10",
    name: "Проведення воркшопу",
    price: "150$",
    description: "Можливість провести воркшоп або тренінг для учасників під час офіційного відкриття змагань тривалістю до 40 хвилин.",
    available: 0
  },
];

export default addOptions;