
import { Package } from "@/types/types";

const packages: Package[] = [
  {
    id: "1",
    name: "Basic",
    price: "350$",
    features: [
      "Логотип на брендволлі",
      "Логотип у постівентному відео",
      "Промоція в соцмережах",
      "Участь у нетворкінгу",
      "Можливість надання судді або/і ментора",
    ],
    descriptions: [
      "Під час події буде розміщений великий банер з логотипами всіх партнерів наших змагань.",
      "Додавання логотипа у поствідео, яке буде виставлено на Instagram-сторінці @best_lviv після завершення змагань.",
      "Розміщення інформації про компанію в соціальних мережах: згадка в 1 Instagram-stories на сторінці @best_lviv, пост-дайджест у Telegram (інформація про Вашу компанію буде розміщена в пості про всіх партнерів)",
      "Нетворкінг — це зустріч представників компанії, учасників події та організаторів у неформальній атмосфері. Компанія матиме чудову можливість детально розповісти студентам про себе та представити наявні вакансії та стажування. Нетворкінг відбуватиметься в день офіційного закриття змагань.",
      "Компанія надає ментора або/і суддю для категорій ID/TD. На змаганнях будуть менторські сесії, під час яких учасники матимуть змогу отримати поради від кваліфікованих працівників Вашої компанії.",
    ],
  },
  {
    id: "2",
    name: "Explorer",
    price: "400$",
    features: [
      "Тестові співбесіди з учасниками",
      "Пост у LinkedIn",
      "Проведення інтерактивних розіграшів",
      "Instagram-інтерактив \"День із компанією\"",
      "Розсилка вакансій у Telegram-боті",
    ],
    descriptions: [
      "Під час нетворкінгу учасники змагань спробують себе у короткій співбесіді разом з представниками Вашої компанії. Це можливість виявити нові таланти та перспективних працівників серед студентської спільноти.",
      "Розміщення інформації про компанію в LinkedIn окремим постом.",
      "Можливість провести розіграш від компанії — це може бути Kahoot, Quiz або можете приєднатись до благодійного розіграшу нашої компанії, про Вашу участь скажуть на сцені.",
      "Після проведення івенту Instagram–stories нашої сторінки будуть наповнені контентом Вашої компанії. Ви можете надіслати свої відео або ж наша команда допоможе у їх створенні. Таких сторіз буде до 3.",
      "Щомісяця, впродовж пів року у Telegram-боті BEC’2025, будуть розміщуватись актуальні вакансії Вашої компанії.",
    ],
  },
  {
    id: "3",
    name: "Engineer",
    price: "700$",
    features: [
      "Номінація від компанії на категорію TD/ID",
      "Розсилка вакансій у Telegram-боті",
      "Відео-представлення компанії",
      "Проведення воркшопу",
      "Доступ до бази CV учасників",
      "Стаття на сайті BEST Lviv",
      "Логотип на мерчі",
    ],
    descriptions: [
      "Ви зможете обрати власну номінацію на змаганнях та нагородити команду, рішення або виступ якої найбільше резонує саме Вашій компанії, пропозиція діє лише на одну категорію або ID, або TD, причому дві компанії не можуть мати номінації на одній категорії.",
      "Щомісяця, впродовж пів року у Telegram-боті BEC’2025, будуть розміщуватись актуальні вакансії Вашої компанії.",
      "Можливість презентувати свою компанію учасникам на нетворкінгу у вигляді відео, яке триватиме до 5 хвилин.",
      "Можливість провести воркшоп або тренінг для учасників під час офіційного відкриття змагань тривалістю до години.",
      "Можливість отримати доступ до бази CV учасників змагань.",
      "На офіційному сайті змагань та організації буде розміщено статтю про Вашу компанію та її внесок в організацію події.",
      "Логотип компанії буде використовуватись на мерчі івенту (плакат, футболки (переможцям+волонтерам)).",
    ],
  },
];

export default packages;