
import { Package } from "@/types/types";

const packages: Package[] = [
  {
    id: "1",
    name: "Basic",
    price: "350$",
    features: [
      "Участь у нетворкінгу",
      "Надання судді або/і ментора",
      "Логотип на брендволлі",
      "Логотип у пост-відео",
      "Промоція у соцмережах (1 пост, 1 сторі)",
      "Згадка про компанію в after-movie",
    ],
    descriptions: [
      "Нетворкінг – це зустріч представників компанії, учасників події та організаторів у неформальній атмосфері. Компанія матиме чудову можливість детально розповісти студентам про себе та представити наявні вакансії і стажування. Нетворкінг відбуватиметься в день офіційного закриття змагань.",
      "Компанія надає ментора або/і суддю для категорій ID/TD. На змаганнях будуть менторські сесії, під час яких учасники матимуть змогу отримати поради від кваліфікованих працівників Вашої компанії. ",
      "Під час події буде розміщений великий банер з логотипами всіх партнерів наших змагань.",
      "Додавання логотипа у пост–відео, яке буде виставлено на Instagram-сторінці @best_lviv після завершення змагань.",
      "Розміщення інформації про компанію в соціальних мережах: згадка в 1 Instagram-stories на сторінці @best_lviv, 1 пост в LinkedIn організації.",
      "Ваша компанія буде відображена в офіційному after-movie, який охопить ключові моменти змагань і збере максимальну увагу з боку учасників, партнерів та глядачів у соцмережах. Це не просто реклама — це емоційна прив’язка бренду до динаміки, інновацій та командного духу. Ідеально для покращення HR-бренду та залучення молодих талантів.",
    ],
  },
  {
    id: "2",
    name: "Recruiter",
    price: "400$",
    features: [
      "Розсилка вакансій в Telegram-боті",
      "Тестові співбесіди з учасниками",
      "Пост-дайджест у Telegram",
      "День з компанією",
      "Проведення інтерактивних розіграшів",
    ],
    descriptions: [
      "Піврічна розсилка вакансій компанії у нашому Telegram-боті, що призначений для реєстрації, важливих анонсів та комунікації під час події.",
      "Під час нетворкінгу учасники змагань спробують себе у короткій співбесіді разом з представниками Вашої компанії. Це можливість виявити нові таланти та перспективних працівників серед студентської спільноти.",
      "Ваша компанія буде відображена в офіційному after-movie, який охопить ключові моменти змагань і збере максимальну увагу з боку учасників, партнерів та глядачів у соцмережах. Це не просто реклама — це емоційна прив’язка бренду до динаміки, інновацій та командного духу. Ідеально для покращення HR-бренду та залучення молодих талантів.",
      "Можливість провести воркшоп або тренінг для учасників під час офіційного відкриття змагань тривалістю до 40 хвилин.",
      "Можливість презентувати свою компанію учасникам перед нетворкінгом у вигляді відео, яке триватиме до 5 хвилин.",
    ],
  },
  {
    id: "3",
    name: "Engineer",
    price: "700$",
    features: [
      "Номінація від компанії",
      "Доступ до бази CV учасників",
      "Логотип на мерчі",
      "Відео-представлення компанії",
      "Стаття про компанію на сайті події",
      "Згадка про компанію в after-movie",
      "Участь у воркшопі",
    ],
    descriptions: [
      "Ви зможете обрати власну номінацію на змаганнях та нагородити команду, рішення або виступ якої найбільше резонує саме Вашій компанії.",
      "Можливість отримати доступ до бази CV учасників змагань.",
      "Лого компанії буде використовуватись на мерчі івенту (плакат, стікерпак, футболка).",
      "Можливість презентувати свою компанію учасникам перед нетворкінгом у вигляді відео, яке триватиме до 5 хвилин.",
      "На офіційному сайті змагань та організації буде розміщено статтю про Вашу компанію та її внесок в організацію події.",
      "Ваша компанія буде відображена в офіційному after-movie, який охопить ключові моменти змагань і збере максимальну увагу з боку учасників, партнерів та глядачів у соцмережах. Це не просто реклама — це емоційна прив’язка бренду до динаміки, інновацій та командного духу. Ідеально для покращення HR-бренду та залучення молодих талантів.",
      "Можливість провести воркшоп або тренінг для учасників під час офіційного відкриття змагань тривалістю до 40 хвилин",
    ],
  },
];

export default packages;