
import { Package } from "@/types/types";

const packages: Package[] = [
  {
    id: "1",
    name: "Basic",
    price: "350$",
    features: [
      "Участь у нетворкінгу",
      "Надання судді або/і ментора",
      "Логотип на брендволлі",
      "Логотип у пост-відео",
      "Промоція у соцмережах (1 пост, 1 сторі)",
      "Згадка про компанію в after-movie",
    ],
    descriptions: [
      "Нетворкінг – це зустріч представників компанії, учасників події та організаторів у неформальній атмосфері. Компанія матиме чудову можливість детально розповісти студентам про себе та представити наявні вакансії і стажування. Нетворкінг відбуватиметься в день офіційного закриття змагань.",
      "Компанія надає ментора або/і суддю для категорій ID/TD. На змаганнях будуть менторські сесії, під час яких учасники матимуть змогу отримати поради від кваліфікованих працівників Вашої компанії. ",
      "Під час події буде розміщений великий банер з логотипами всіх партнерів наших змагань.",
      "Додавання логотипа у пост–відео, яке буде виставлено на Instagram-сторінці @best_lviv після завершення змагань.",
      "Розміщення інформації про компанію в соціальних мережах: згадка в 1 Instagram-stories на сторінці @best_lviv, 1 пост в LinkedIn організації.",
      "Ваша компанія буде відображена в офіційному after-movie, який охопить ключові моменти змагань і збере максимальну увагу з боку учасників, партнерів та глядачів у соцмережах. Це не просто реклама — це емоційна прив\'язка бренду до динаміки, інновацій та командного духу. Ідеально для покращення HR-бренду та залучення молодих талантів.",
    ],
  },
  {
    id: "2",
    name: "Recruiter",
    price: "350$",
    features: [
      "Доступ до бази CV",
      "Розсилка вакансій у Telegram-боті",
      "Тестовий спікери",
      "Згадка в after-movie",
      "Участь у воркшопі",
      "Відео-представлення компанії",
    ],
    descriptions: [
      "Доступ до бази CV учасників івенту.",
      "Розсилка вакансій у Telegram-боті для учасників івенту.",
      "Тестовий спікер — це можливість протестувати ідеї, які будуть представлені на івенті.",
      "Згадка про компанію в after-movie.",
      "Участь у воркшопі для учасників івенту.",
      "Відео-представлення компанії, яке буде показане під час івенту.",
    ],
  },
  {
    id: "3",
    name: "Engineer",
    price: "700$",
    features: [
      "Номінація від компанії",
      "CV учасника",
      "Лого на мерчі",
      "Відео-представлення компанії",
      "Розсилка вакансій у боті",
      "Стати на сайт",
      "Згадка про компанію в after-movie",
      "Участь у воркшопі",
    ],
    descriptions: [
      "Компанія може номінувати учасника івенту.",
      "CV учасника буде надано компанії.",
      "Логотип компанії буде розміщений на мерчі івенту.",
      "Відео-представлення компанії, яке буде показано під час івенту.",
      "Розсилка вакансій у Telegram-боті для учасників івенту.",
      "Стаття про компанію буде розміщена на сайті івенту.",
      "Згадка про компанію в after-movie.",
      "Участь у воркшопі для учасників івенту.",
    ],
  },
];

export default packages;